<?php
    function TH($time)
    {
        $dAY  = array("อาทิตย์", "จันทร์", "อังคาร", "พุธ", "พฤหัสบดี", "ศุกร์", "เสาร์");
        $mTH = array(
            "0" => "",
            "1" => "มกราคม",
            "2" => "กุมภาพันธ์",
            "3" => "มีนาคม",
            "4" => "เมษายน",
            "5" => "พฤษภาคม",
            "6" => "มิถุนายน",
            "7" => "กรกฎาคม",
            "8" => "สิงหาคม",
            "9" => "กันยายน",
            "10" => "ตุลาคม",
            "11" => "พฤศจิกายน",
            "12" => "ธันวาคม"
        );
        $TH = "วัน" . $dAY[date("w",)];
        $TH .= " ที่ " . date("j", );
        $TH .= " เดือน " . $mTH[date("n",)];
        $TH .= " พ.ศ. " . (date("Y",) + 543);
        return $TH;
    }
    $th_date = time();
    echo TH($th_date);
    ?>